3<PAD>
<UNK>
<EOS>
the
.
and
walk
turn
left
right
to
go
of
,
stop
on
stairs
into
room
door
in
down
wait
through
a
at
past
you
hallway
doorway
bedroom
straight
exit
enter
then
bathroom
up
table
with
your
towards
front
take
hall
out
kitchen
forward
around
next
near
by
first
doors
continue
top
bed
chairs
steps
end
make
until
there
pass
area
once
outside
wall
glass
head
open
that
leave
two
chair
couch
inside
toward
across
bottom
just
white
when
side
livingroom
get
double
sink
ahead
before
reach
diningroom
large
from
second
staircase
step
between
after
fireplace
way
closet
stand
are
house
passed
dining
behind
is
going
it
rug
entrance
pool
set
counter
move
walking
patio
office
landing
'
all
desk
wooden
black
small
painting
other
keep
facing
corner
floor
mirror
red
again
three
slight
middle
along
bar
laundry
couches
slightly
passing
stair
archway
blue
another
leading
see
entryway
onto
round
long
window
foot
last
an
follow
will
building
carpet
hard
brown
plant
balcony
be
stopping
sliding
piano
few
opening
wood
away
one
railing
sittingarea
tv
bench
directly
face
sofa
beside
using
flight
proceed
tub
far
tables
sitting
entry
pooltable
opposite
back
refrigerator
this
third
picture
windows
where
"
main
-
toilet
shower
vase
as
ll
walkway
sharp
under
foyer
leads
green
over
entering
corridor
cross
degrees
massage
stairwell
lounge
here
bathtub
s
veer
stairway
stove
cabinet
porch
path
statue
lamp
upstairs
them
which
exitsign
re
dinning
art
downstairs
television
beds
leather
immediate
potted
so
hanging
big
immediately
garage
climb
island
four
marble
fridge
home
has
kitchenisland
pictures
base
grey
2
exercise
can
tile
more
stone
stools
arched
plants
flowers
coffeetable
center
dresser
banister
start
pillar
edge
standing
stepping
deck
living
paintings
empty
shelves
walls
very
sign
hand
mat
sinks
cabinets
shelf
nearest
feet
metal
light
bookshelf
wine
closest
looking
heading
chandelier
off
halfway
some
fourth
narrow
have
/
elevator
screen
short
direction
case
travel
purple
washer
circular
bookcase
should
sculpture
yellow
thermostat
dryer
about
circle
though
arch
clock
five
stay
threshold
above
come
indoors
gym
lightswitch
column
pillars
taking
theater
framed
christmastree
rope
furniture
desks
keeping
exiting
brick
couple
level
via
turning
little
descend
gray
oven
spiral
columns
rest
orange
but
artwork
reaching
pantry
library
outdoor
gate
need
doorways
closed
tall
those
lobby
benches
sets
half
machine
study
ceiling
ninety
restroom
hot
striped
bookshelves
following
seating
3
ottoman
he
sofas
locker
for
rocking
wicker
both
rail
gold
intersection
180
pathway
reception
tiled
french
pink
now
fireextinguisher
sauna
moving
guitar
2nd
square
u
equipment
flower
bath
pingpongtable
lightswitches
while
partition
(
conference
single
bear
treadmill
suite
nightstand
lead
ascend
zebra
carpeted
)
work
curved
tree
stool
silver
located
destination
bike
beige
piece
dark
against
flooring
lockers
space
washingmachine
farthest
animal
built
seat
leftmost
pews
armchairs
horse
arm
mosaic
book
pot
frame
soon
covered
upwards
90
each
quick
cloth
welcome
reached
elevators
recliner
grand
master
hardwood
divider
not
waterfountain
aisle
six
curtains
vanity
finish
says
till
do
ve
doorframe
find
tapestry
man
clear
forwards
t
look
4
den
watercooler
great
mirrors
staircases
storage
even
flights
armchair
opens
outdoors
display
en
smaller
fifth
hammock
adjacent
o
degree
curve
concrete
planter
position
phone
iron
jacuzzi
continuing
giant
row
entered
close
oval
beach
poster
ground
place
exterior
photos
mini
utility
almost
locate
ovens
faucet
colorful
breakfast
alongside
parallel
ballroom
platform
fan
marked
fitness
alcove
decoration
staying
game
drawers
shaped
either
movie
underneath
length
rocks
doormat
visible
entire
counters
portrait
cellar
holes
rectangular
anotherroom
ladder
tan
prior
kitchenette
towels
books
pillows
rooms
beyond
or
basket
colored
seats
beginning
buffet
drum
midway
..
microwave
further
panel
rock
sidewalk
these
bit
sectional
candles
dog
water
leaving
grill
upon
displaycase
downwards
marilyn
box
1
roped
same
runner
abstract
meeting
men
arrive
floors
grass
well
console
family
print
garden
chaise
5
monroe
immediatly
45
lower
otherroom
turns
rightmost
hang
dishwasher
radiator
stones
railings
vent
vases
part
ends
passageway
workout
computer
section
barber
nook
without
ropes
diagonally
wet
like
checkered
ornate
loveseat
countertop
machines
arcade
its
frosted
flag
barrier
sixth
arches
sconce
begin
line
spa
guardrail
women
board
climbing
frames
let
lamps
unfinished
trash
photo
floral
fire
final
making
granite
patterned
mounted
clockwise
several
waterheater
church
floored
wide
wardrobe
bedrooms
basketball
court
dots
shoes
lights
waiting
painted
altar
love
velvet
curtain
fancy
break
lattice
loft
many
swing
pots
recreation
3rd
opened
hit
statues
full
below
dot
pattern
angle
meet
arc
labeled
remaining
looks
swimmingpool
trees
bust
tennis
copy
froward
furthest
bridal
upper
pillow
washroom
winding
cactus
coat
credenza
host
placed
cheetah
descending
beneath
put
our
blanket
christmastrees
folding
planters
tot
bush
started
approach
;
american
curving
#
curves
swinging
mirrored
decorative
eight
archways
larger
tiles
backyard
still
photographs
bigger
post
extreme
sailboat
goes
pas
easel
comforter
hallways
seven
hundred
eighty
promptly
no
yourself
baskets
girl
walked
bowl
containing
distance
screened
golden
structure
arrow
getting
recliners
tops
drinkingfountain
old
also
arcadegame
rounded
chest
flat
design
panes
interior
children
gallery
low
holding
rugs
telephone
infront
nest
changes
settee
billiards
ladies
tablecloth
loungers
footstool
use
openings
sit
urn
fork
dogleg
oriental
kids
pocket
construction
salon
posters
woman
giraffe
dinner
only
veering
number
towelrack
stars
plaque
object
armoire
arrangement
wreath
billiard
foosballtable
overlooking
closets
rack
don
doorknob
ledge
bushes
avoid
filled
thing
stained
backside
. .
topped
if
11
restrooms
drawer
lady
current
twin
shelving
ascending
palm
alter
jump
than
fence
pedestal
made
banquet
cushions
terrace
point
indoor
followed
saxophone
ball
too
paper
dressing
cupboards
fruit
brass
cement
rear
nearby
reading
pivot
feather
burgundy
clothes
entertainment
goal
decorations
bathrooms
handle
passage
thought
starting
cushioned
barstools
support
polka
watermelon
grandfatherclock
central
gravel
lounging
ship
steel
cylinder
dividers
paneled
surrounded
portraits
pulp
fiction
padded
deer
showerstall
pause
airvent
lit
candle
cow
arrived
projectorscreen
entrances
pig
they
hutch
guitars
view
woven
formal
talk
lounger
faced
finally
towel
grate
approximately
plywood
treadmills
pair
carpeting
theatre
unit
teh
sunset
stacked
6
bird
zebras
garbagebin
son
leopard
car
plate
trunk
handing
enerskin
powder
heater
washingmachines
enclosed
fake
pipes
spot
huge
4th
keyboard
roof
crossing
elliptical
wrap
marbled
air
lines
pole
sides
hangings
skin
were
any
pgi
mats
straw
body
