<PAD>
<UNK>
<EOS>
the
.
and
walk
turn
left
right
to
go
of
,
stop
on
room
stairs
into
door
down
in
wait
through
a
at
past
you
hallway
doorway
straight
bedroom
exit
table
enter
then
up
bathroom
with
your
towards
take
front
hall
kitchen
out
next
forward
around
by
near
first
doors
continue
bed
steps
top
end
chairs
area
dining
until
make
there
once
pass
wall
outside
head
that
open
glass
living
leave
bottom
two
couch
chair
inside
across
toward
just
side
when
get
white
ahead
double
before
sink
reach
second
from
large
step
staircase
between
after
pool
way
fireplace
closet
stand
are
passed
rug
is
house
going
it
behind
entrance
set
counter
move
all
wooden
red
walking
patio
'
landing
floor
other
corner
small
office
sitting
black
painting
keep
mirror
desk
facing
again
three
along
bar
another
middle
slight
carpet
archway
couches
passing
laundry
slightly
stair
leading
blue
see
follow
window
onto
entryway
long
round
an
foot
last
hard
will
brown
plant
building
sliding
stopping
island
be
piano
few
balcony
wood
opening
directly
one
railing
away
tv
sign
beside
flight
sofa
far
face
tub
using
proceed
entry
bench
refrigerator
back
this
opposite
toilet
shower
third
windows
picture
"
tables
light
where
vase
under
-
sharp
ll
leads
massage
as
foyer
cabinet
over
main
entering
walkway
green
stove
here
degrees
corridor
cross
four
path
stairway
stairwell
statue
downstairs
lamp
bathtub
s
veer
porch
lounge
big
upstairs
art
television
dinning
fridge
hanging
coffee
potted
immediate
arched
them
which
re
has
leather
tile
more
immediately
so
garage
edge
exercise
climb
home
marble
grey
wine
beds
stools
base
banister
pictures
center
flowers
2
start
standing
stone
can
plants
dresser
clock
pillar
deck
shelves
case
tree
stepping
nearest
mat
very
shelf
paintings
looking
some
cabinets
arch
walls
empty
off
hand
short
chandelier
direction
halfway
bookshelf
oven
travel
water
circular
machine
closest
/
feet
pantry
sinks
though
should
heading
metal
have
above
narrow
circle
bookcase
christmas
sculpture
washer
fourth
screen
yellow
dryer
framed
couple
thermostat
switch
threshold
furniture
fire
come
pillars
purple
level
exiting
five
gym
brick
rope
about
theater
keeping
elevator
gray
sauna
column
stay
descend
little
outdoor
via
indoors
taking
turning
reaching
frame
columns
lobby
library
display
sets
doorways
for
desks
sofas
tall
those
rest
need
closed
ninety
bath
artwork
3
intersection
spiral
ceiling
french
study
hot
following
orange
but
both
striped
gate
half
180
ottoman
he
tiled
treadmill
pathway
seating
rocking
bookshelves
moving
benches
wicker
pink
flower
fountain
gold
locker
ping
square
washing
pong
rail
now
restroom
extinguisher
seat
switches
bear
stool
beige
u
destination
carpeted
suite
lead
reception
dark
fitness
single
90
against
2nd
equipment
while
located
animal
ve
each
man
guitar
pot
nightstand
leftmost
covered
(
book
work
silver
partition
welcome
lockers
ascend
)
bike
counters
flooring
armchairs
vases
zebra
grass
reached
pews
mosaic
upwards
conference
storage
arm
curved
piece
platform
not
den
rack
farthest
ladder
microwave
space
soon
finish
cellar
console
master
do
quick
till
ground
built
flights
game
degree
hardwood
en
parallel
aisle
ropes
entered
vanity
says
divider
t
horse
find
look
cloth
six
curtain
elevators
jacuzzi
curtains
even
place
recliner
phone
drawers
photos
clear
grand
bit
position
visible
adjacent
roped
row
mirrors
breakfast
4
curve
forwards
outdoors
either
opens
close
beaded
basket
underneath
colored
grill
tapestry
beyond
giant
concrete
continuing
oval
rooms
dog
doormat
o
fifth
armchair
ovens
staircases
fan
locate
smaller
planter
midway
iron
railings
exterior
immediatly
staying
these
alongside
trees
arcade
great
length
drum
vent
beach
cooler
post
sidewalk
marked
downwards
towel
alcove
shaped
frames
tan
hammock
almost
utility
machines
mini
runner
..
prior
without
pillows
lower
radiator
poster
books
pots
rectangular
well
seats
like
colorful
towels
photo
arrive
rightmost
buffet
or
holes
further
its
beginning
faucet
part
barrier
portrait
movie
decoration
entire
leaving
panel
ballroom
candles
ends
upon
men
workout
rocks
turns
box
love
countertop
same
heater
5
kitchenette
waiting
1
yard
placed
passageway
diagonally
floors
several
support
abstract
making
climbing
nook
design
family
patterned
loveseat
marilyn
clockwise
footstool
45
hang
loft
air
board
old
eye
altar
spa
floral
rock
mirrored
section
hit
meeting
monroe
ornate
garden
let
baskets
sectional
pattern
statues
guardrail
frosted
wardrobe
bust
angle
lamps
wide
begin
checkered
dressing
dishwasher
mounted
coat
print
stones
church
line
recreation
women
looks
chaise
below
decorative
blanket
basketball
goes
pillow
labeled
sailboat
girl
3rd
pas
barber
unfinished
sixth
floored
starting
washroom
flag
also
bedrooms
;
promptly
eight
computer
painted
lattice
wet
hallways
fence
sconce
chest
approach
if
tops
descending
upper
credenza
shoes
yourself
cushioned
many
telephone
nest
trash
full
court
backyard
bigger
rugs
dot
started
arches
meet
tot
final
urn
beam
swimming
made
granite
cactus
lights
thing
break
velvet
curio
tiles
dots
cheetah
still
opened
swing
stars
armoire
alter
fancy
veering
put
american
stall
chart
#
remaining
furthest
drinking
extreme
larger
curving
billiard
our
oriental
getting
clothes
planters
golden
arrow
comforter
distance
infront
. .
bush
seven
night
dinner
tennis
no
barstools
backside
copy
winding
interior
froward
bowl
low
cream
dogleg
woman
followed
rounded
bushes
archways
arc
folding
point
bridal
bin
posters
walked
loungers
easel
beneath
curves
indoor
swinging
recliners
ledge
foosball
host
star
bannister
hutch
cushions
don
holding
containing
plaque
openings
current
filled
eighty
tablecloth
talk
terrace
than
11
only
pivot
pedestal
children
trunk
flat
paper
number
rails
hundred
please
screened
formal
palm
garbage
structure
overlooking
sit
arrangement
entertainment
decorations
billiards
gallery
antelope
photographs
areas
feather
splits
closets
ball
mats
panes
throught
kids
changes
atrium
violin
salon
giraffe
object
pocket
watermelon
bottles
boxes
fork
topped
passage
woven
change
shelving
stuffed
stained
nearby
twin
fruit
rear
pole
central
ladies
deer
brass
weight
lit
banquet
wreath
pew
sunken
electrical
cupboards
use
globe
steel
settee
handle
polka
thought
avoid
letters
construction
urns
cylinder
unit
would
dividers
ascending
approximately
too
faced
people
mantle
ship
skin
finally
bedside
fake
marbled
drawer
4th
view
any
pair
sunset
reading
bathrooms
being
restrooms
stationary
lounging
grandfather
saxophone
teh
burgundy
unicycle
doorframe
6
goal
doorknob
cement
arrived
lady
candle
block
rows
sides
gravel
jump
bird
butler
high
lines
bathing
beads
crossing
spot
completely
bookcases
pgi
powder
int
treadmills
projection
straw
roof
keyboard
entrances
they
fiction
reclining
portraits
zebras
padded
rectangle
new
lots
handrail
handing
vaulted
landscape
lips
playroom
wrap
class
paneled
crystal
carpeting
cow
guitars
run
thirty
projector
cases
car
counting
suitcases
huge
halt
were
theatre
lawn
shoe
lighted
outlet
exam
ways
vertical
tun
stacked
media
stepped
throw
pulp
ten
enerskin
stick
horizontal
signs
style
houseplant
surrounded
enclosed
dividing
barn
plywood
leopard
lounger
e
barbecue
pipes
body
plate
elliptical
instead
hangings
sculptures
diagonal
pendant
slider
intersecting
mid
son
pause
grain
gone
homes
ski
grate
pig
dinging
entryways
bicycle
net
niche
smoke
word
candelabra
scene
slats
l
went
backgammon
wash
plastic
begins
scenes
person
letter
rice
runs
bay
china
split
plates
hat
background
security
meters
everything
sop
fabric
sailboats
panels
longer
paces
attic
makeup
weird
downtown
walled
magazine
map
wheelchair
serving
petition
squared
remainder
advance
tusks
hub
microwaves
shop
hockey
boat
teddy
minibar
strait
pallet
downward
twelve
tubs
drums
image
walks
tight
podium
finished
ceramic
robes
hamper
sun
cylindrical
appliances
rustic
diamond
nine
dress
pane
instructions
station
entranceway
showers
mountain
stiars
impact
series
bare
hollow
siting
boy
solid
leaning
anymore
paneling
...
bamboo
scale
blackboard
similar
exits
mural
crab
sharply
control
meter
bunch
tray
bouquet
their
shallow
dishes
able
detector
closer
written
boulders
copier
bbq
extinguishers
plaid
lake
hose
stainless
curtained
fireplaces
encounter
wooded
lampshade
supplies
cardboard
items
direclty
arms
overhead
rights
want
checkerboard
flowerbed
forty
laid
revolving
ro
surrounding
stalls
metallic
circles
medical
bridge
steam
traverse
liquor
02
banisters
chrome
conversational
child
tank
player
meets
boiler
opportunity
bedspread
human
stanchions
enters
opp
possible
antique
offices
cord
lefts
takes
plug
barred
contains
music
form
hear
exist
handicap
coach
skylight
posts
drawings
stands
perpendicular
appears
extra
sports
thru
futon
elephant
may
6th
corners
squares
correct
seventh
baluster
massive
driveway
tanning
slab
aside
veranda
spaces
foward
orchids
attached
reenter
receptacle
bottle
gated
rose
except
buddha
slatted
bathtubs
cowhide
einstein
darker
cinema
birdcage
fixtures
th
got
tea
pulpit
sticking
screens
remain
beautiful
dual
division
urinals
rather
lighting
upholstered
20
dolls
urinal
orient
really
guest
heads
twenty
draped
breezeway
most
plan
extremely
cover
basement
common
bars
vine
314
lion
available
whole
onward
wastebasket
adjoining
navigate
balloons
shag
shape
wiat
showing
semi
balls
eating
clay
fern
doll
nice
pottery
having
trough
twice
video
traveling
metre
sword
popcorn
hexagon
339
labelled
animals
crossed
thin
pieces
triangle
native
cupboard
farm
racks
lined
transparent
strip
separating
minifridge
could
grated
recessed
fountains
text
ones
words
bead
organ
motorcycle
workbench
aqua
flowered
workroom
twelfth
i
rotary
showpiece
drawing
arriving
rafter
sized
does
stage
boards
tiling
upward
galley
quickly
informational
intersects
maroon
pit
guitarist
inset
branch
wing
portion
hats
whose
quilt
chaises
street
walkout
sideways
paining
york
prints
344
barbers
wand
beauty
wrought
writing
ached
headboard
clothed
ventilation
spider
cathedral
enclosure
goo
starts
viewing
chevron
daybed
target
paved
endtable
seen
thorough
oil
saying
ending
radio
cushion
covering
bag
flanked
04
drawn
360
angling
heating
chandeliers
faces
rightside
relaxation
trapdoor
tiny
striaght
160
reddish
drumset
leaves
cane
things
toaster
wheel
moose
waterfall
drip
ocean
materials
peligro
had
pavement
dead
poolside
doorstep
pail
zigzag
raised
magazines
wal
wat
halls
dollhouse
prayer
check
nd
til
setting
digital
carts
time
push
rod
trashcan
stanchion
daybeds
tanks
shirts
drinks
gazebo
alone
buck
adjustable
handles
club
aright
graphic
pine
drapery
placemat
st
pointed
group
monitor
tucked
easle
wagon
drop
quarter
canvas
cars
motion
turk
walkthrough
city
mermaid
hug
nqhg
18
victorian
apples
danger
say
goright
chessboard
printer
multiple
throuhg
printed
sheets
greyish
peice
slot
blinds
cannot
hedge
aluminum
enterance
degress
barbeque
burst
horned
wheels
bureau
geometric
dome
color
pop
centerpiece
handicapped
residence
newspaper
eventually
sleeping
bags
different
wires
patchwork
baptismal
bricks
momentum
read
overlooks
vertically
oddly
stops
herringbone
road
foreward
log
enough
cacti
cooker
ad
separate
original
pointing
swirly
triptych
bistro
chalk
stoop
intersect
windowed
directions
exited
backed
shrubbery
barroom
continute
plank
held
food
units
fish
fixture
7
bast
teal
dirt
houses
saloon
wlk
done
changing
passes
temperature
5th
paint
store
hotel
instruction
dispenser
graffiti
build
outhouse
quote
chars
gilt
model
hyena
barrel
tubes
bulletin
beams
b
chimney
withe
perfume
vestibule
river
11th
smallest
c
reverse
restaurant
oriente
vessel
instrument
fur
barricade
30
stoves
shuttered
snail
keys
cigar
moment
canisters
vending
rotate
d
ignore
metres
connecting
sharper
whiteboard
range
seeing
rolls
:
butlers
z
char
warning
ottomans
peices
mantel
leaded
young
barstool
odd
business
leg
objects
sing
makes
lime
camera
becomes
crosses
buildings
wallpaper
collection
faucets
linen
allow
bins
dinette
nerolie
trieste
instruments
material
hands
trimmed
glasses
tenth
hedges
await
umbrella
rung
righ
shell
lot
receptionist
sewing
statute
neighboring
pipe
skinny
crate
staff
jar
jam
tape
pants
antechamber
jog
rooftop
la
dressers
carved
goodfellas
plaques
viaggio
paving
awning
breaker
359
bananas
stairways
headed
jars
identical
recycling
doored
know
criss
candy
soft
leaf
shrub
decorated
triangular
gain
bearing
pie